/*******************************************************************************
 *   Filename:       cvi_file.h
 *   Revised:        All copyrights reserved to redmorningcn.
 *   Revision:       v1.0
 *   Writer:	     redmorningcn.
 *
 *   Description:    
		     双击选中 otr 按 Ctrl + H, 钩选 Match the case, Replace with
 *                   输入您要的名字，点击 Replace All
 *                   双击选中 Otr 按 Ctrl + H, 钩选 Match the case, Replace with
 *                   输入您要的名字，点击 Replace All
 *                   双击选中 OTR 按 Ctrl + H, 钩选 Match the case, Replace with
 *                   输入您要的名字，点击 Replace All
 *                   在 app_cfg.h 中指定本任务的 优先级  （ APP_TASK_COMM_PRIO     ）
 *                                            和 任务堆栈（ APP_TASK_COMM_STK_SIZE ）大小
 *
 *   Notes:
 *     				E-mail: redmorningcn@qq.com
 *
 *******************************************************************************/

#ifndef	SNED_DATA_H
#define	SNED_DATA_H

/********************************************************************************************/
/* Include files																			*/
/********************************************************************************************/
#include "asynctmr.h"
#include <utility.h>
#include <ansi_c.h>
#include <cvirte.h>		
#include <userint.h>
#include <formatio.h> 
#include <comconfig.h>         
#include "pc_csnr.h"    

/********************************************************************************************/
/* Constants																					*/
/********************************************************************************************/
extern	unsigned char	senddatabuf[256];
extern  unsigned char 	txdatabuf[256];


/*******************************************************************************************
/结构体																				 
*******************************************************************************************/


/********************************************************************************************/
/* Globals																					*/
/********************************************************************************************/
//串口结构体及通讯
extern	unsigned char 	txdatabuf[256];  

/*******************************************************************************************
数据发送： SendFileData()
发送SendFileData的内容
*******************************************************************************************/
extern	void	SendFileData(void);

/*******************************************************************************************
数据发送： SendCsnrDataDeal
将数据按照协议格式发送。
格式的值  	系统运行时自动更改。
*******************************************************************************************/
void	SendRecordRecEcho(void);



/*******************************************************************************
 *              end of file                                                    *
 *******************************************************************************/

#endif
